<?php 

$lessons =[
    1 =>[
        'title' => 'ساختمان داده ها و الگوریتم',
        'vahed' => 3,
        'term'  => 1,
        'program' => [0,12],
    ],
    2 =>[
        'title' => 'مباحثی در علوم کامپیوتر',
        'vahed' => 3,
        'term'  => 2,
        'program' => [1,9],
    ],
    3 =>[
        'title' => 'مدارهای منطقی',
        'vahed' => 3,
        'term'  => 2,
        'program' => [1,9],
    ],
    4 =>[
        'title' => 'اصول سیستم های کامپیوتری',
        'vahed' => 3,
        'term'  => 2,
        'program' => [2,11],
    ],
    5 =>[
        'title' => 'پایگاه داده ها',
        'vahed' => 3,
        'term'  => 2,
        'program' => [3,10],
    ],
    6 =>[
        'title' => 'زبان های برنامه سازی',
        'vahed' => 3,
        'term'  => 2,
        'program' => [3,14],
    ],
    7 =>[
        'title' => 'هوش مصنوعی',
        'vahed' => 3,
        'term'  => 2,
        'program' => [3,11],
    ],
    8 =>[
        'title' => 'زبان تخصصی',
        'vahed' => 3,
        'term'  => 2,
        'program' => [4,18],
    ],
    9 =>[
        'title' => 'مبانی نظریه محاسبه',
        'vahed' => 3,
        'term'  => 2,
        'program' => [4,14],
    ],
    10 =>[
        'title' => 'برنامه سازی پیشرفه',
        'vahed' => 3,
        'term'  => 2,
        'program' => [5,13],
    ],
    11 =>[
        'title' => 'جبر خطی عددی',
        'vahed' => 3,
        'term'  => 2,
        'program' => [5,13],
    ],
    12 =>[
        'title' => 'اصول طراحی نرم افزار',
        'vahed' => 3,
        'term'  => 2,
        'program' => [6,19],
    ],
    13 =>[
        'title' => 'طراحی و تحلیل الگوریتم ها',
        'vahed' => 3,
        'term'  => 2,
        'program' => [6,19],
    ],
    14 =>[
        'title' => 'بهینه سازی غیر خطی',
        'vahed' => 3,
        'term'  => 2,
        'program' => [7,13],
    ],
    15 =>[
        'title' => 'شبکه های کامپیوتری',
        'vahed' => 3,
        'term'  => 2,
        'program' => [7,15],
    ],
    16 =>[
        'title' => 'کامپایلر',
        'vahed' => 3,
        'term'  => 2,
        'program' => [8,16],
    ],
    17 =>[
        'title' => 'مبانی منطق و نظریه مجموعه ها',
        'vahed' => 3,
        'term'  => 2,
        'program' => [8,16],
    ],
    18 =>[
        'title' => 'اصول سیستم عامل',
        'vahed' => 3,
        'term'  => 2,
        'program' => [10,20],
    ],
];