<?php 

$lessons =[
    1 =>[
        'title' => 'ساختمان داده ها و الگوریتم',
        'vahed' => 3,
        'term'  => 1,
        'program' => [0,15],
    ],
    2 =>[
        'title' => 'مباحثی در علوم کامپیوتر',
        'vahed' => 3,
        'term'  => 2,
        'program' => [3,10],
    ],
    3 =>[
        'title' => 'مدارهای منطقی',
        'vahed' => 3,
        'term'  => 2,
        'program' => [4,13],
    ],
    4 =>[
        'title' => 'اصول سیستم های کامپیوتری',
        'vahed' => 3,
        'term'  => 2,
        'program' => [7,11],
    ],
    5 =>[
        'title' => 'پایگاه داده ها',
        'vahed' => 3,
        'term'  => 2,
        'program' => [2,19],
    ],
    6 =>[
        'title' => 'زبان های برنامه سازی',
        'vahed' => 3,
        'term'  => 2,
        'program' => [9,3],
    ],
    7 =>[
        'title' => 'هوش مصنوعی',
        'vahed' => 3,
        'term'  => 2,
        'program' => [13,4],
    ],
    8 =>[
        'title' => 'زبان تخصصی',
        'vahed' => 3,
        'term'  => 2,
        'program' => [6,10],
    ],
    9 =>[
        'title' => 'مبانی نظریه محاسبه',
        'vahed' => 3,
        'term'  => 2,
        'program' => [0,19],
    ],
    10 =>[
        'title' => 'برنامه سازی پیشرفه',
        'vahed' => 3,
        'term'  => 2,
        'program' => [4,10],
    ],
    11 =>[
        'title' => 'جبر خطی عددی',
        'vahed' => 3,
        'term'  => 2,
        'program' => [11,17],
    ],
    12 =>[
        'title' => 'اصول طراحی نرم افزار',
        'vahed' => 3,
        'term'  => 2,
        'program' => [15,2],
    ],
    13 =>[
        'title' => 'طراحی و تحلیل الگوریتم ها',
        'vahed' => 3,
        'term'  => 2,
        'program' => [1,18],
    ],
    14 =>[
        'title' => 'بهینه سازی غیر خطی',
        'vahed' => 3,
        'term'  => 2,
        'program' => [5,12],
    ],
    15 =>[
        'title' => 'شبکه های کامپیوتری',
        'vahed' => 3,
        'term'  => 2,
        'program' => [14,3],
    ],
    16 =>[
        'title' => 'کامایلر',
        'vahed' => 3,
        'term'  => 2,
        'program' => [18,9],
    ],
    17 =>[
        'title' => 'مبانی منطق و نظریه مجموعه ها',
        'vahed' => 3,
        'term'  => 2,
        'program' => [16,8],
    ],
    18 =>[
        'title' => 'اصول سیستم عامل',
        'vahed' => 3,
        'term'  => 2,
        'program' => [2,11],
    ],
];